Masmiseim36/nxpSDK/boards/frdmk32l3a6_agm01/project_template/pin_mux.c
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v5.0
processor: K32L3A60xxx
package_id: K32L3A60VPJ1A
mcu_data: ksdk2_0
processor_version: 0.0.1
board: FRDM-K32L3A6
pin_labels:
- {pin_num: A1, pin_signal: PTA30_0/LLWU_P3_0/LPUART2_CTS_b_0/LPSPI1_SOUT_0/FB_AD14_0/TPM1_CH0_0/LPTMR2_ALT2_0, label: 'J1[12]/ARDUINO_D5/PWM'}
- {pin_num: B1, pin_signal: PTB2/LLWU_P5/LPSPI0_PCS1/LPUART1_RX/SAI0_TX_D0/FB_AD11/TPM0_CH0, label: 'J2[2]/ARDUINO_D8'}
- {pin_num: C1, pin_signal: ADC0_SE0/PTB3/LPSPI0_PCS3/LPUART1_TX/SAI0_TX_FS/FB_AD10/TPM0_CH1, label: 'J2[4]/ARDUINO_D9/PWM'}
- {pin_num: E1, pin_signal: PTB6/LLWU_P7/LPSPI0_PCS2/LPI2C1_SDA/SAI0_RX_BCLK/FB_AD7/TPM0_CH4, label: 'J2[6]/ARDUINO_D10/SPI0_PCS2'}
- {pin_num: G1, pin_signal: PTB15/LPI2C1_HREQ/LPI2C3_SCL/FB_CS5_b/FB_TSIZ1/FB_BE23_16_b/TPM0_CLKIN/FXIO0_D5, label: 'J3[15]/FLEXIO_D5'}
- {pin_num: J1, pin_signal: PTB20/LLWU_P11/LPSPI1_SCK/LPUART2_CTS_b/FB_CS0_b/TPM1_CH0/FXIO0_D10, label: 'U15[6]/MEMORY/SPI2_SCK'}
- {pin_num: L1, pin_signal: PTB22/LLWU_P12/LPSPI1_PCS2/LPUART0_CTS_b/LPI2C2_SDA/FB_AD3/TPM2_CLKIN/FXIO0_D12, label: 'U15[1]/MEMORY/SPI2_PCS0'}
- {pin_num: N1, pin_signal: PTC0/SAI0_RX_FS/FB_A20, label: NC}
- {pin_num: R1, pin_signal: ADC0_SE4/LPCMP0_IN2/PTC9/LLWU_P16/LPSPI0_SOUT/LPUART0_CTS_b/LPI2C0_SDA/TPM0_CH2/LPTMR0_ALT2, label: 'J2[18]/ARDUINO_D14/I2C0_SDA'}
- {pin_num: T1, pin_signal: ADC0_SE6/PTC11/LLWU_P17/LPSPI0_SIN/LPI2C1_SDA/LPI2C0_SDAS/TPM0_CH4/EWM_IN, label: 'J4[2]/ARDUINO_A0/ADC0_SE6'}
- {pin_num: U1, pin_signal: VDD_DCDC41, label: 'J49[2]'}
- {pin_num: A2, pin_signal: PTA28/LPUART1_RTS_b/LPSPI3_PCS0/FB_AD28, label: NC}
- {pin_num: B2, pin_signal: PTA30_1/LLWU_P3_1/LPUART2_CTS_b_1/LPSPI1_SOUT_1/FB_AD14_1/TPM1_CH0_1/LPTMR2_ALT2_1, label: 'J1[12]/ARDUINO_D5/PWM'}
- {pin_num: C2, pin_signal: ADC0_SE1/PTB4/LLWU_P6/LPSPI0_SCK/LPUART1_CTS_b/SAI0_TX_BCLK/FB_AD9/TPM0_CH2, label: 'J2[12]/ARDUINO_D13/SPI0_SCK'}
- {pin_num: D2, pin_signal: PTB5/LPSPI0_SOUT/LPUART1_RTS_b/SAI0_MCLK/FB_AD8/TPM0_CH3, label: 'J2[8]/ARDUINO_D11/SPI0_SOUT'}
- {pin_num: E2, pin_signal: ADC0_SE2/PTB7/LLWU_P8/LPSPI0_SIN/LPI2C1_SDAS/SAI0_RX_FS/FB_AD6/TPM0_CH5, label: 'J2[10]/ARDUINO_D12/SPI0_SIN'}
- {pin_num: G2, pin_signal: PTB14/LPUART2_RTS_b/LPI2C1_SCL/LPI2C0_SCLS/FB_AD24/TPM3_CH1/FXIO0_D4, label: 'J1[10]/ARDUINO_D4'}
- {pin_num: H2, pin_signal: PTB18/LPSPI1_PCS1/LPUART2_RX/LPI2C3_SDAS/FB_CS3_b/FB_BE7_0_b/FB_TA_b/FXIO0_D8, label: NC}
- {pin_num: J2, pin_signal: PTB21/LPSPI1_SOUT/LPUART2_RTS_b/LPI2C2_HREQ/FB_AD4/TPM1_CH1/FXIO0_D11, label: 'U15[5]/MEMORY/SPI2_SOUT'}
- {pin_num: L2, pin_signal: PTB24/LPSPI1_SIN/LPUART0_RTS_b/LPI2C2_SCL/FB_AD2/EWM_IN/FXIO0_D13, label: 'U15[2]/MEMORY/SPI2_SIN'}
- {pin_num: M2, pin_signal: PTC1/SAI0_RX_BCLK/FB_A21, label: NC}
- {pin_num: N2, pin_signal: LPCMP0_IN0/PTC7/LLWU_P15/LPSPI0_PCS3/LPUART0_RX/LPI2C1_HREQ/TPM0_CH0/LPTMR1_ALT1, label: 'U40[1]/K32W_UART0_RX', identifier: DEBUG_UART0_RX}
- {pin_num: R2, pin_signal: ADC0_SE5/PTC10/LPSPI0_PCS2/LPUART0_RTS_b/LPI2C0_SCL/TPM0_CH3, label: 'J2[20]/ARDUINO_D15/I2C0_SCL'}
- {pin_num: T2, pin_signal: VDD_DCDC191, label: 'J49[2]'}
- {pin_num: U2, pin_signal: LP, label: 'L12[1]'}
- {pin_num: A3, pin_signal: PTA27/LPUART1_CTS_b/LPSPI3_SIN/FB_AD29, label: 'J1[6]/ARDUINO_D2'}
- {pin_num: B3, pin_signal: PTB0/LPUART2_TX/LPSPI1_SIN/USB0_SOF_OUT/CLKOUT/TPM1_CLKIN, label: NC}
- {pin_num: C3, pin_signal: PTB1/LLWU_P4/LPUART2_RX/LPSPI1_PCS0/SAI0_TX_D1/FB_AD12/LPTMR1_ALT3, label: 'J1[16]/ARDUINO_D7'}
- {pin_num: E3, pin_signal: VDDIO1155, label: 'J16[2]/J28[1]'}
- {pin_num: G3, pin_signal: PTB13/LPUART2_CTS_b/LPI2C1_SDA/LPI2C0_SDAS/FB_AD25/TPM3_CH0/FXIO0_D3, label: 'J1[8]/ARDUINO_D3/PWM'}
- {pin_num: J3, pin_signal: VDDIO123, label: 'J16[2]/J28[1]'}
- {pin_num: L3, pin_signal: PTB29/LPUART3_TX/SAI0_TX_FS/FB_A17/FXIO0_D16, label: 'J2[19]/FLEXIO_D16'}
- {pin_num: N3, pin_signal: VSS33, label: GND}
- {pin_num: P3, pin_signal: LPCMP0_IN1/PTC8/LPSPI0_SCK/LPUART0_TX/LPI2C0_HREQ/TPM0_CH1, label: 'U11[1]/K32W_UART0_TX', identifier: DEBUG_UART0_TX}
- {pin_num: R3, pin_signal: ADC0_SE7/PTC12/LLWU_P18/LPSPI0_PCS0/LPI2C1_SCL/LPI2C0_SCLS/TPM0_CH5/EWM_OUT_b, label: 'J4[4]/ARDUINO_A1/ADC0_SE7'}
- {pin_num: T3, pin_signal: VOUT_RF45, label: 'J48[1]'}
- {pin_num: U3, pin_signal: GND, label: GND}
- {pin_num: C4, pin_signal: PTA31/LPUART2_RTS_b/LPSPI1_PCS2/FB_AD13/TPM1_CH1, label: 'J1[14]/ARDUINO_D6/PWM/CMP'}
- {pin_num: E4, pin_signal: VDDIO1141, label: 'J16[2]/J28[1]'}
- {pin_num: P5, pin_signal: VDDIO169, label: 'J16[2]/J28[1]'}
- {pin_num: R5, pin_signal: VDDIO155, label: 'J16[2]/J28[1]'}
- {pin_num: C9, pin_signal: VDDIO19, label: 'J16[2]/J28[1]'}
- {pin_num: J10, pin_signal: VDDIO134, label: 'J16[2]/J28[1]'}
- {pin_num: F4, pin_signal: ADC0_SE3/PTB9/SPM_LPREQ/LPSPI0_PCS1/LPI2C1_SCL/SAI0_RX_D1/FB_RW_b/FXIO0_D0, label: 'J4[6]/J47[2]/ARDUINO_A2/ADC0_SE3', identifier: SNS_LIGHT_ADC}
- {pin_num: G4, pin_signal: PTB12/LPUART2_TX/LPI2C1_SCLS/LPI2C0_SCL/FB_AD26/TPM3_CLKIN/FXIO0_D2, label: NC}
- {pin_num: J4, pin_signal: VSS22, label: GND}
- {pin_num: K4, pin_signal: PTB19/LPSPI1_PCS3/LPUART2_TX/FB_ALE/FB_CS1_b/FB_TS_b/TPM1_CLKIN/FXIO0_D9, label: NC}
- {pin_num: L4, pin_signal: PTB26/USB0_SOF_OUT/LPUART0_TX/LPI2C2_SCLS/FB_AD0/LPCMP0_OUT, label: NC}
- {pin_num: M4, pin_signal: PTB28/LLWU_P14/LPUART3_RX/SAI0_TX_D0/FB_A16/FXIO0_D15, label: NC}
- {pin_num: N4, pin_signal: VSS_USB0, label: GND}
- {pin_num: T4, pin_signal: LN, label: 'L12[2]'}
- {pin_num: A5, pin_signal: PTA26/LPUART1_TX/LPSPI3_PCS2/LPI2C2_SCLS/FB_AD30, label: 'J1[4]/ARDUINO_D1_UART1_TX/UART1_TX_SDA'}
- {pin_num: B5, pin_signal: PTA25/LPUART1_RX/LPSPI3_SOUT/LPI2C2_SDAS/FB_AD31, label: 'J1[2]/ARDUINO_D0_UART1_RX/UART1_RX_SDA'}
- {pin_num: C5, pin_signal: VSS165, label: GND}
- {pin_num: D5, pin_signal: VSS8, label: GND}
- {pin_num: F5, pin_signal: PTB8/LLWU_P9/LPSPI0_PCS0/LPI2C1_SCLS/SAI0_RX_D0/FB_AD5/LPTMR0_ALT1, label: NC}
- {pin_num: H5, pin_signal: PTB16/LLWU_P10/LPUART3_CTS_b/LPI2C3_SDA/FB_CS4_b/FB_TSIZ0/FB_BE31_24_b/FXIO0_D6, label: 'J3[13]/FLEXIO_D6'}
- {pin_num: K5, pin_signal: PTB17/LPUART3_RTS_b/LPI2C3_SCLS/FB_TBST_b/FB_CS2_b/FB_BE15_8_b/FXIO0_D7, label: 'J3[11]/FLEXIO_D7'}
- {pin_num: T5, pin_signal: VOUT_CORE, label: NC}
- {pin_num: M5, pin_signal: PTB30/SAI0_TX_BCLK/FB_A18, label: NC}
- {pin_num: U5, pin_signal: PTC28/LPSPI0_PCS1/TPM0_CH3/FXIO0_D17, label: 'J2[17]/FLEXIO_D17'}
- {pin_num: B6, pin_signal: PTA22/LLWU_P2/LPSPI2_PCS2/LPI2C2_HREQ/FB_AD16/TPM2_CH2, label: 'Q6[2]/LED_BLUE', identifier: RGB_BLUE}
- {pin_num: D6, pin_signal: PTA24/LPSPI2_PCS0/LPSPI1_SCK/LPI2C2_SCL/FB_OE_b/TPM2_CH0, label: 'Q7[2]/LED_RED', identifier: RGB_RED}
- {pin_num: E6, pin_signal: PTA23/LPSPI2_SIN/LPSPI1_PCS3/LPI2C2_SDA/FB_AD15/TPM2_CH1, label: 'Q7[5]/LED_GREEN', identifier: RGB_GREEN}
- {pin_num: G6, pin_signal: PTB11/LPUART2_RX/LPI2C1_SDAS/LPI2C0_SDA/FB_AD27/FXIO0_D1, label: NC}
- {pin_num: L6, pin_signal: PTB25/LLWU_P13/LPSPI1_PCS0/LPUART0_RX/LPI2C2_SDAS/FB_AD1/EWM_OUT_b/FXIO0_D14, label: NC}
- {pin_num: N6, pin_signal: PTC29/LPUART1_RX/LPSPI0_PCS3/TPM0_CH2/FXIO0_D18, label: 'J2[15]/FLEXIO_D18'}
- {pin_num: P6, pin_signal: PTC27/TPM0_CH4, label: 'J9[G1]/SD_DETECT', identifier: SD_DETECT}
- {pin_num: A7, pin_signal: PTA15/LPI2C2_SCL/FB_AD22, label: NC}
- {pin_num: B7, pin_signal: PTA21/LPSPI2_SOUT/EMVSIM0_PD/FB_AD17/TPM2_CH3, label: 'J3[1]/ARDUINO_EMVSIM_PD'}
- {pin_num: C7, pin_signal: PTA20/LPSPI2_SCK/LPSPI1_PCS1/EMVSIM0_IO/FB_AD18/TPM2_CH4, label: 'J3[3]/ARDUINO_EMVSIM_IO'}
- {pin_num: D7, pin_signal: PTA19/LPSPI2_PCS3/LPSPI3_SCK/EMVSIM0_VCCEN/FB_AD19/TPM2_CH5, label: 'J3[5]/ARDUINO_EMVSIM_VCCEN'}
- {pin_num: F7, pin_signal: PTA17/LPI2C2_HREQ/LPSPI3_PCS1/EMVSIM0_CLK/FB_AD21, label: 'J3[7]/ARDUINO_EMVSIM_CLK'}
- {pin_num: M7, pin_signal: PTB31/SAI0_RX_D0/FB_A19, label: NC}
- {pin_num: P7, pin_signal: PTD1/LPUART1_RTS_b/LPSPI0_PCS2/EWM_IN/FXIO0_D21, label: 'J2[9]/FLEXIO_D21'}
- {pin_num: R7, pin_signal: PTC30/LPUART1_TX/LPSPI0_SCK/TPM0_CH1/FXIO0_D19, label: 'J2[13]/FLEXIO_D19'}
- {pin_num: T7, pin_signal: PTD0/LPUART1_CTS_b/LPSPI0_SOUT/TPM0_CH0/FXIO0_D20, label: 'J2[11]/FLEXIO_D20'}
- {pin_num: U7, pin_signal: PTD2/SDHC0_D7/LPSPI0_SIN/EWM_OUT_b/FXIO0_D22, label: 'J2[7]/FLEXIO_D22'}
- {pin_num: D8, pin_signal: PTA18/LPSPI2_PCS1/LPSPI3_PCS3/EMVSIM0_SRST/FB_AD20, label: 'J3[7]/ARDUINO_EMVSIM_RST'}
- {pin_num: E8, pin_signal: PTA14/LPI2C2_SDA/FB_AD23/LPCMP0_OUT, label: NC}
- {pin_num: H8, pin_signal: VSS172, label: GND}
- {pin_num: J8, pin_signal: VDD_CORE88, label: 'J10[2]'}
- {pin_num: K8, pin_signal: VSS174, label: GND}
- {pin_num: N8, pin_signal: PTD4/SDHC0_D5/LPSPI2_PCS1/EMVSIM0_SRST/FXIO0_D24, label: 'J2[3]/FLEXIO_D24'}
- {pin_num: T8, pin_signal: PTD3/SDHC0_D6/LPSPI0_PCS0/EMVSIM0_CLK/TPM2_CLKIN/FXIO0_D23, label: 'J2[5]/FLEXIO_D23'}
- {pin_num: A9, pin_signal: PTA10/LPI2C2_SCLS/LPSPI3_SOUT/FB_A22, label: NC}
- {pin_num: B9, pin_signal: PTA4/LPUART0_RTS_b/LPI2C0_SCLS/LPUART1_RTS_b/LPCMP0_OUT/JTAG_TMS/SWD_DIO, label: 'J7[2]/SWD_DIO_TGTMCU'}
- {pin_num: D9, pin_signal: VSS169, label: GND}
- {pin_num: H9, pin_signal: VDD_CORE133, label: 'J10[2]'}
- {pin_num: K9, pin_signal: VDDIO1135, label: 'J16[2]/J28[1]'}
- {pin_num: P9, pin_signal: VSS48, label: GND}
- {pin_num: R9, pin_signal: VDDIO147, label: 'J16[2]/J28[1]'}
- {pin_num: T9, pin_signal: ADC0_SE11/PTD8/LLWU_P19/SDHC0_DCLK/LPSPI2_PCS2/LPI2C1_SDAS/TRACE_DATA1/TPM2_CH3/FXIO0_D28, label: 'J9[P5]/SDHC0_DCLK', identifier: SDHC0_DCLK}
- {pin_num: U9, pin_signal: ADC0_SE9/PTD6/SDHC0_D1/LPSPI2_SCK/EMVSIM0_IO/TRACE_DATA3/TPM2_CH5/FXIO0_D26, label: 'J9[P8]/SDHC0_D1', identifier: SDHC0_D1}
- {pin_num: B10, pin_signal: PTA0/NMI_b, label: BUTTON_NMI, identifier: SW2}
- {pin_num: E10, pin_signal: PTA9/LPI2C2_SDAS/LPSPI3_SCK/FB_A23, label: NC}
- {pin_num: H10, pin_signal: VSS173, label: GND}
- {pin_num: K10, pin_signal: VSS89, label: GND}
- {pin_num: N10, pin_signal: ADC0_SE8/PTD5/SDHC0_D4/LPSPI2_PCS3/EMVSIM0_VCCEN/FXIO0_D25, label: 'J2[1]/FLEXIO_D25'}
- {pin_num: P10, pin_signal: ADC0_SE10/PTD7/SDHC0_D0/LPSPI2_SOUT/EMVSIM0_PD/TRACE_DATA2/TPM2_CH4/FXIO0_D27, label: 'J9[P7]/SDHC0_D0', identifier: SDHC0_D0}
- {pin_num: A11, pin_signal: XTAL_RF, label: 'Y3[1]/XTAL_32M', identifier: XTAL_RF}
- {pin_num: B11, pin_signal: EXTAL_RF, label: 'Y3[3]/EXTAL_32M', identifier: EXTAL_RF}
- {pin_num: C11, pin_signal: RF_CLKOUT, label: TP19}
- {pin_num: D11, pin_signal: PTA3/LPUART0_TX/LPI2C0_SCL/LPUART1_TX/TPM0_CLKIN/JTAG_TDO/SWD_SWO, label: 'J7[6]/SWD_SWO_TGTMCU'}
- {pin_num: F11, pin_signal: PTA2/LLWU_P1/LPUART0_RX/LPI2C0_SDA/LPUART1_RX/JTAG_TDI, label: NC}
- {pin_num: M11, pin_signal: ADC0_SE21/LPCMP1_IN1/PTE4/SDHC0_D6/LPI2C0_SCL/LPSPI3_SOUT/CLKOUT/TPM1_CLKIN, label: 'J4[8]/ARDUINO_A3/ADC0_SE21'}
- {pin_num: P11, pin_signal: ADC0_SE13/PTD10/LLWU_P20/SDHC0_D3/LPSPI2_PCS0/LPI2C1_SDA/TRACE_CLK_OUT/TPM2_CH1/FXIO0_D30, label: 'J9[P2]/SDHC0_D3', identifier: SDHC0_D3}
- {pin_num: R11, pin_signal: ADC0_SE14/PTD11/SDHC0_D2/USB0_SOF_OUT/LPI2C1_SCL/CLKOUT/TPM2_CH0/FXIO0_D31, label: 'J9[P1]/SDHC0_D2', identifier: SDHC0_D2}
- {pin_num: T11, pin_signal: USB0_DP, label: 'J8[3]/K32W_USB_DP', identifier: USB0_DP}
- {pin_num: U11, pin_signal: ADC0_SE12/PTD9/SDHC0_CMD/LPSPI2_SIN/LPI2C1_SCLS/TRACE_DATA0/TPM2_CH2/FXIO0_D29, label: 'J9[P3]/SDHC0_CMD', identifier: SDHC0_CMD}
- {pin_num: D12, pin_signal: RESET_b, label: 'J3[6]/J7[10]/J11[3]/RST_SDA'}
- {pin_num: E12, pin_signal: PTA1/LLWU_P0/LPUART0_CTS_b/LPI2C0_SDAS/LPUART1_CTS_b/JTAG_TCLK/SWD_CLK, label: 'J7[4]/K32W_SWD_SCK'}
- {pin_num: G12, pin_signal: TAMPER2, label: 'J4[1]/TAMPER2'}
- {pin_num: L12, pin_signal: PTE12/LLWU_P26/SDHC0_D2/LPI2C3_SDAS/TPM3_CLKIN/FXIO0_D2, label: BUTTON_LLWUP26, identifier: SW5}
- {pin_num: N12, pin_signal: ADC0_SE20/LPCMP1_IN0/PTE3/LLWU_P22/SDHC0_D7/LPI2C0_SDA/LPSPI3_SCK/TPM0_CLKIN/LPTMR0_ALT3, label: 'J4[12]/ARDUINO_A5/ADC0_SE20'}
- {pin_num: P12, pin_signal: ADC0_SE19/PTE2/SDHC0_D0/LPI2C0_SCLS/LPSPI3_PCS3/LPCMP1_OUT, label: 'J4[7]/ARDUINO_A4/ADC0_SE19'}
- {pin_num: T12, pin_signal: USB0_DM, label: 'J8[2]/K32W_USB_DN', identifier: USB0_DM}
- {pin_num: A13, pin_signal: VSS154, label: GND}
- {pin_num: B13, pin_signal: VDD_RF123, label: 'L11[1]'}
- {pin_num: C13, pin_signal: VSS166, label: GND}
- {pin_num: D13, pin_signal: VDDIO290, label: 'J14[2]'}
- {pin_num: F13, pin_signal: TAMPER1/RTC_CLKOUT, label: 'J4[3]/TAMPER1/RTC_CLKOUT'}
- {pin_num: H13, pin_signal: TAMPER3, label: NC}
- {pin_num: K13, pin_signal: PTE18/SAI0_RX_D0/TPM2_CH2/FXIO0_D8, label: 'J1[15]/ARDUINO_I2S_RXD'}
- {pin_num: M13, pin_signal: PTE10/LLWU_P25/SDHC0_D4/LPUART3_CTS_b/LPI2C3_SDA/TPM3_CH0/LPTMR2_ALT3, label: ARDUINO_A4/I2C_SDA}
- {pin_num: P13, pin_signal: VSS70, label: GND}
- {pin_num: R13, pin_signal: VSS56, label: GND}
- {pin_num: T13, pin_signal: VOUT33, label: P2V3_K32W}
- {pin_num: U13, pin_signal: VREGIN, label: 'J31[2]'}
- {pin_num: B14, pin_signal: VSS162, label: GND}
- {pin_num: E14, pin_signal: VSS134, label: GND}
- {pin_num: F14, pin_signal: TAMPER0/RTC_WAKEUP_b, label: 'J4[5]/TAMPER0/RTC_WAKEUP_b'}
- {pin_num: G14, pin_signal: PTE28/LPUART3_RTS_b/LPI2C3_SCLS/FXIO0_D29, label: NC}
- {pin_num: J14, pin_signal: VSS105, label: GND}
- {pin_num: L14, pin_signal: PTE16/SAI0_RX_BCLK/TPM2_CH0/FXIO0_D6, label: 'J1[9]/ARDUINO_I2S_RX_BCLK'}
- {pin_num: M14, pin_signal: PTE11/SDHC0_D3/LPUART3_RTS_b/LPI2C3_SCL/TPM3_CH1/FXIO0_D1, label: ARDUINO_A5/I2C_SCL}
- {pin_num: N14, pin_signal: VDD_CORE190, label: 'J10[2]'}
- {pin_num: R14, pin_signal: LPCMP1_IN4/PTE0/EWM_IN, label: NC}
- {pin_num: A15, pin_signal: ANT, label: 'L5[1]'}
- {pin_num: B15, pin_signal: VSS163, label: GND}
- {pin_num: C15, pin_signal: VSS167, label: GND}
- {pin_num: D15, pin_signal: VSS170, label: GND}
- {pin_num: E15, pin_signal: VSS118, label: GND}
- {pin_num: G15, pin_signal: PTE29/LPUART3_RX/LPI2C3_SDA/FXIO0_D30, label: 'U14[6]/ACCEL_I2C3_SDA', identifier: ACCEL_SDA}
- {pin_num: H14, pin_signal: PTE27/LPUART3_CTS_b/LPI2C3_SDAS/FXIO0_D28, label: 'U14[16]/ACCEL_RST', identifier: ACCEL_RST}
- {pin_num: J15, pin_signal: VDDIO2106, label: 'J14[2]'}
- {pin_num: L15, pin_signal: PTE17/SAI0_RX_FS/TPM2_CH1/FXIO0_D7, label: 'J1[13]/ARDUINO_I2S_RX_FS'}
- {pin_num: N15, pin_signal: VDD_CORE49, label: 'J10[2]'}
- {pin_num: R15, pin_signal: VSSA192, label: GND}
- {pin_num: T15, pin_signal: VREF_OUT/ADC0_SE15/LPCMP0_IN5/LPCMP1_IN5, label: VREF_OUT}
- {pin_num: U15, pin_signal: VDDA, label: 'L14[1]/Q1[1]/VDDA_K32W'}
- {pin_num: A16, pin_signal: GANT, label: GANT}
- {pin_num: B16, pin_signal: VSS164, label: GND}
- {pin_num: C16, pin_signal: VSS168, label: GND}
- {pin_num: E16, pin_signal: EXTAL32, label: 'Y1[1]/EXTAL_32KHZ', identifier: EXTAL32}
- {pin_num: F16, pin_signal: VSS171, label: GND}
- {pin_num: G16, pin_signal: VBAT, label: 'J50[2]'}
- {pin_num: J16, pin_signal: PTE22/SAI0_RX_D1/LPI2C3_HREQ/TPM2_CH5/FXIO0_D11, label: 'U14[9]/ACCEL_INT2', identifier: ACCEL_INT2}
- {pin_num: K16, pin_signal: PTE19/SAI0_MCLK/TPM2_CH3/FXIO0_D9, label: 'J1[7]/ARDUINO_I2S_MLCK'}
- {pin_num: L16, pin_signal: PTE14/SAI0_TX_FS/LPI2C3_HREQ/TPM3_CH1/FXIO0_D4, label: 'J1[3]/ARDUINO_I2S_TX_FS'}
- {pin_num: N16, pin_signal: ADC0_SE23/PTE9/LLWU_P24/SDHC0_CMD/LPUART3_TX/LPSPI3_PCS0/TPM1_CH1/FXIO0_D0, label: BUTTON_LLWUP24, identifier: SW4}
- {pin_num: P16, pin_signal: ADC0_SE22/PTE8/LLWU_P23/SDHC0_D5/LPUART3_RX/LPSPI3_SIN/TPM1_CH0/LPTMR2_ALT1, label: BUTTON_LLWUP23, identifier: SW3}
- {pin_num: R16, pin_signal: ADC0_SE18/PTE1/LLWU_P21/SDHC0_D1/LPI2C0_SDAS/LPSPI3_PCS1/EWM_OUT_b/LPTMR1_ALT2, label: 'U14[11]/ACCEL_INT1', identifier: ACCEL_INT1}
- {pin_num: T16, pin_signal: VSSA80, label: GND}
- {pin_num: U16, pin_signal: VREFH, label: VREFH}
- {pin_num: A17, pin_signal: VSS140, label: GND}
- {pin_num: B17, pin_signal: VDD_RF120, label: 'L11[1]'}
- {pin_num: C17, pin_signal: VDD_RF119, label: 'L11[1]'}
- {pin_num: E17, pin_signal: XTAL32, label: 'Y1[2]/XTAL_32KHZ', identifier: XTAL32}
- {pin_num: G17, pin_signal: PTE30/LPUART3_TX/LPI2C3_SCL/TPM2_CLKIN/FXIO0_D31, label: 'U14[4]/ACCEL_I2C3_SCL', identifier: ACCEL_SCL}
- {pin_num: J17, pin_signal: PTE21/SAI0_TX_D1/USB0_SOF_OUT/TPM2_CH4/FXIO0_D10, label: 'J1[11]/ARDUINO_AUIDO_SOF/SOF_OUT'}
- {pin_num: L17, pin_signal: PTE15/SAI0_TX_D0/TPM3_CLKIN/FXIO0_D5, label: 'J1[5]/ARDUINO_I2S_TXD'}
- {pin_num: N17, pin_signal: PTE13/SAI0_TX_BCLK/LPI2C3_SCLS/TPM3_CH0/FXIO0_D3, label: 'J1[1]/ARDUINO_I2S_TX_BCLK'}
- {pin_num: R17, pin_signal: LPCMP1_IN2/PTE5/SDHC0_DCLK/LPI2C0_HREQ/LPSPI3_PCS2/LPCMP1_OUT, label: 'J4[9]/LPCMP1_IN2/LPCMP1_OUT'}
- {pin_num: T17, pin_signal: DAC0_OUT/ADC0_SE16/LPCMP0_IN3/LPCMP1_IN3, label: 'DAC0_OUT/J4[11]/ADC0_SE16/LPCMP0_IN3/LPCMP1_IN3'}
- {pin_num: U17, pin_signal: VREFL, label: VREFL}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

